In [2]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([10, 88, 3, 4, 5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [3]:
ser = pd.Series([10, 88, 3, 4, 5])

In [4]:
ser

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [5]:
type(ser)

pandas.core.series.Series

In [6]:
ser.dtype

dtype('int64')

In [7]:
ser.shape

(5,)

In [8]:
ser.size

5

In [9]:
ser.ndim

1

In [10]:
ser.values

array([10, 88,  3,  4,  5])

In [11]:
ser.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
[i for i in ser.values]

[10, 88, 3, 4, 5]

In [13]:
ser.head(3)   # default 5

0    10
1    88
2     3
dtype: int64

In [14]:
ser.tail(3)   # default 5

2    3
3    4
4    5
dtype: int64

In [15]:
pd.Series([i for i in 'clarusway'])

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [16]:
labels = ['a', 'b', 'c']

In [17]:
my_list = [10, 20, 30]

In [18]:
arr = np.array([10, 20, 30])

In [19]:
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [20]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [21]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [24]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [25]:
pd.Series(d, labels)

a    10
b    20
c    30
dtype: int64

In [26]:
pd.Series(d, my_list)

10   NaN
20   NaN
30   NaN
dtype: float64

In [27]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [28]:
mix_data = pd.Series([1, 'cat', True])

In [29]:
mix_data

0       1
1     cat
2    True
dtype: object

In [30]:
# .sort_index() .sort_values() .isin()

In [31]:
ser1 = pd.Series([1, 2, 3, 4], index = ['USA', 'Germany', 'USSR', 'Japan'])

In [32]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [33]:
ser2 = pd.Series([1, 2, 5, 4], index = ['USA', 'Germany', 'Italy', 'Japan'])

In [34]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [35]:
ser1['USA']

1

In [36]:
ser3 = pd.Series(data = labels)

In [37]:
ser3

0    a
1    b
2    c
dtype: object

In [38]:
ser3[0]

'a'

In [39]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [40]:
(ser1 + ser2)['Germany']

4.0

In [41]:
a = np.array([1, 2, 33, 444, 75])

In [42]:
a

array([  1,   2,  33, 444,  75])

In [43]:
panser = pd.Series(a)

In [44]:
panser

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [45]:
panser[0]

1

In [46]:
panser[0:3]

0     1
1     2
2    33
dtype: int64

In [47]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [48]:
ser1['USA' : 'USSR']  # for object index last value is inclusive

USA        1
Germany    2
USSR       3
dtype: int64

In [49]:
panser = pd.Series([121, 200, 150, 99], ['ali', 'veli', 'gül', 'nur'])

In [50]:
panser

ali     121
veli    200
gül     150
nur      99
dtype: int64

In [51]:
panser['ali']

121

In [52]:
panser[0]

121

In [53]:
panser[['veli', 'nur']]

veli    200
nur      99
dtype: int64

In [54]:
panser[[0, 2, 3]]

ali    121
gül    150
nur     99
dtype: int64

In [55]:
panser[0 : 2]

ali     121
veli    200
dtype: int64

In [56]:
panser['ali' : 'gül']

ali     121
veli    200
gül     150
dtype: int64

In [57]:
panser.index

Index(['ali', 'veli', 'gül', 'nur'], dtype='object')

In [58]:
panser.values

array([121, 200, 150,  99])

In [59]:
panser.items

<bound method Series.items of ali     121
veli    200
gül     150
nur      99
dtype: int64>

In [60]:
panser.items()

In [61]:
list(panser.items())

[('ali', 121), ('veli', 200), ('gül', 150), ('nur', 99)]

In [62]:
'mehmet' in panser

False

In [63]:
'ali' in panser

True

In [64]:
200 in panser.values

True

In [65]:
200 in panser

False

In [66]:
panser['veli'] = 571

In [67]:
panser

ali     121
veli    571
gül     150
nur      99
dtype: int64

In [68]:
panser > 130

ali     False
veli     True
gül      True
nur     False
dtype: bool

In [69]:
panser[panser > 130]

veli    571
gül     150
dtype: int64

In [70]:
#DataFrame

In [71]:
datam = [1, 2, 39, 67, 90]

In [72]:
datam

[1, 2, 39, 67, 90]

In [73]:
pd.DataFrame(datam, columns = ['column_name'])

   column_name
0            1
1            2
2           39
3           67
4           90

In [74]:
m = np.arange(1, 10).reshape(3, 3)

In [75]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [76]:
pd.DataFrame(m, columns = ['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [77]:
pd.DataFrame(data = m, columns = ['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [78]:
df = pd.DataFrame(data = m, columns = ['var1', 'var2', 'var3'])

In [79]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [80]:
df.head(1)

   var1  var2  var3
0     1     2     3

In [81]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [82]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [83]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [84]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [85]:
df.columns = ['new1', 'new2', 'new3']

In [86]:
df

   new1  new2  new3
0     1     2     3
1     4     5     6
2     7     8     9

In [87]:
type(df)

pandas.core.frame.DataFrame

In [88]:
df.shape

(3, 3)

In [89]:
df.size

9

In [90]:
df.ndim

2

In [91]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [92]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [93]:
s1

array([4, 8, 9, 5, 8])

In [94]:
s2

array([7, 2, 7, 4, 1])

In [95]:
s3

array([8, 8, 3, 0, 2])

In [96]:
my_dict = {'var1' : s1, 'var2' : s2, 'var3' : s3}

In [97]:
df1 = pd.DataFrame(my_dict)

In [98]:
df1

   var1  var2  var3
0     4     7     8
1     8     2     8
2     9     7     3
3     5     4     0
4     8     1     2

In [99]:
# example1.csv

In [100]:
pwd

'/home/navarra/anaconda3'

In [101]:
pd.read_csv('example1.csv', delimiter = ';')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [102]:
df3 = pd.read_csv('example1.csv', delimiter = ';')

In [103]:
df3.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [104]:
########

In [105]:
df1

   var1  var2  var3
0     4     7     8
1     8     2     8
2     9     7     3
3     5     4     0
4     8     1     2

In [106]:
df1[1 : 3]

   var1  var2  var3
1     8     2     8
2     9     7     3

In [107]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [108]:
[i for i in df1.index]

[0, 1, 2, 3, 4]

In [109]:
df1.index = ['a', 'b', 'c', 'd', 'e']

In [110]:
df1

   var1  var2  var3
a     4     7     8
b     8     2     8
c     9     7     3
d     5     4     0
e     8     1     2

In [111]:
df1['a' : 'c']

   var1  var2  var3
a     4     7     8
b     8     2     8
c     9     7     3

In [112]:
'var1' in df1

True

In [113]:
'joseph' in df1

False

In [114]:
'a' in df1

False

In [115]:
8 in df1

False

In [116]:
from numpy.random import randn
np.random.seed(101)

In [117]:
df4 = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [118]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [119]:
df4['W']       # it gives Series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [120]:
type(df4['W'])

pandas.core.series.Series

In [121]:
df4['W'].values

array([ 2.70684984,  0.65111795, -2.01816824,  0.18869531,  0.19079432])

In [122]:
df4['W'].ndim

1

In [123]:
df4[['W']]     # two brackets give DataFrame

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [124]:
df4[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [125]:
wz_df4 = df4[['W', 'Z']]

In [126]:
wz_df4

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [127]:
df4.W   # = df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [128]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
df4['A' : 'C']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [130]:
df4['C' : 'C']

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [131]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [132]:
df4['new'] = df4['W'] + df4['Y']

In [133]:
df4

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [134]:
df4.drop(['W', 'Y'], axis = 1)

          X         Z       new
A  0.628133  0.503826  3.614819
B -0.319318  0.605965 -0.196959
C  0.740122 -0.589001 -1.489355
D -0.758872  0.955057 -0.744542
E  1.978757  0.683509  2.796762

In [135]:
df4

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [136]:
df4.drop(['new'], axis = 1, inplace = True)

In [137]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [138]:
df4.drop('E')            # default axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [139]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df4.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [141]:
df4.loc[['B']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965

In [142]:
df4.loc['B' : 'D']

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [143]:
df4.loc[['B', 'E']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [144]:
df4.loc['B', 'W']

0.6511179479432686

In [145]:
df4.loc['B']['W']

0.6511179479432686

In [146]:
df4.loc['B' : 'E'][['Y', 'Z']]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [147]:
df4.loc[['B', 'E']][['Y', 'Z' ]]

          Y         Z
B -0.848077  0.605965
E  2.605967  0.683509

In [148]:
df4.loc[[False, False, True, False, True]]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [149]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [150]:
df4.loc[df4['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [151]:
df5 = pd.DataFrame(np.random.randint(1, 30, (10, 3)), columns = ['var1', 'var2', 'var3'])

In [152]:
df5

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [153]:
df5.loc[1]

var1    25
var2     8
var3     7
Name: 1, dtype: int64

In [154]:
df5.iloc[1]

var1    25
var2     8
var3     7
Name: 1, dtype: int64

In [155]:
df5.loc[1 : 4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [156]:
df5.iloc[1 : 4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [157]:
df5

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [158]:
df5.index = 'a b c d e f g h i j'.split()

In [159]:
df5

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [160]:
df5.loc['b' : 'd']

   var1  var2  var3
b    25     8     7
c    15    10    21
d    19    24     8

In [161]:
df5.iloc[1 : 4]

   var1  var2  var3
b    25     8     7
c    15    10    21
d    19    24     8

In [162]:
df5.iloc[4]

var1     8
var2    16
var3    13
Name: e, dtype: int64

In [163]:
df5.iloc[1, 1]

8

In [164]:
df5.loc['b', 'var2']

8

In [165]:
df5.loc['b' : 'e']['var2']

b     8
c    10
d    24
e    16
Name: var2, dtype: int64

In [166]:
df5.loc['b' : 'e'][['var2']]

   var2
b     8
c    10
d    24
e    16

In [167]:
df5.iloc[1 : 5, 1 : 2]

   var2
b     8
c    10
d    24
e    16

In [168]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [169]:
df4.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [170]:
df4.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [171]:
df4.loc[['A']]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [172]:
df4.iloc[[0]]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [173]:
df4.iloc[:, 2]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [174]:
df4.iloc[:, 2:3]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [175]:
df4.iloc[:, [2]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [176]:
df4[['Y']]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [177]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [178]:
df4.loc['B', 'Y']

-0.8480769834036315

In [179]:
df4.loc[['B'], ['Y']]

          Y
B -0.848077

In [180]:
df4.loc['A' : 'B'][['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [181]:
df4.iloc[0 : 2, [0, 2]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [182]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [183]:
df4 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [184]:
df4[df4 > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [185]:
df4['W'][df4['W'] > 0]

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [186]:
df4[['Y']][df4['W'] > 0]

          Y
A  0.907969
B -0.848077
D -0.933237
E  2.605967

In [187]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [188]:
df4[(df4['W'] > 0) & (df4['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [189]:
df4.loc[(df4['X'] > 0), ['X', 'Z']]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001
E  1.978757  0.683509

In [190]:
df4.loc[(df4['W'] > 2) | (df4['W'] < -2), ['W', 'Y']]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813

In [191]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [192]:
df4.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [193]:
df4.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [194]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [195]:
df4.reset_index(drop = True)               # it removes index column

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [196]:
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [197]:
newindx = 'CA NY WY OR CO'.split()

In [198]:
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [199]:
df4['states'] = newindx

In [200]:
df4

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [201]:
df4.set_index('states', inplace = True)

In [202]:
df4

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [203]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2']                # Multi-index
inside = [1, 2, 3, 1, 2, 3]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1), ('M1', 2), ('M1', 3), ('M2', 1), ('M2', 2), ('M2', 3)]

In [204]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [205]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [206]:
df6 = pd.DataFrame(np.random.randn(6, 2), hier_index, columns = ['A', 'B'])

In [207]:
df6

             A         B
M1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
M2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [208]:
df6.loc['M1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [209]:
df6.loc['M1'].loc[3]

A   -0.116773
B    1.901755
Name: 3, dtype: float64

In [210]:
df6.loc['M1'].loc[[3]]

          A         B
3 -0.116773  1.901755

In [211]:
df6.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [212]:
df6.index.levels

FrozenList([['M1', 'M2'], [1, 2, 3]])

In [213]:
df6.index.names

FrozenList([None, None])

In [214]:
df6.index.names = ['Group', 'Num']

In [215]:
df6

                  A         B
Group Num
M1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
M2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [216]:
df6.xs('M2')

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [217]:
df6.xs(('M2', 2))

A   -0.993263
B    0.196800
Name: (M2, 2), dtype: float64

In [218]:
df6.xs(('M2', 2), level = [0, 1])

                  A       B
Group Num
M2    2   -0.993263  0.1968

In [219]:
df6.xs(2, level = 1)

              A         B
Group
M1    -0.943406  0.484752
M2    -0.993263  0.196800

In [220]:
df6.xs(2, level = 'Num')            # if we don't write in order multi-indexes we need to specify level.

              A         B
Group
M1    -0.943406  0.484752
M2    -0.993263  0.196800

In [221]:
df6.xs('M1', level = 0)

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [222]:
df6

                  A         B
Group Num
M1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
M2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [223]:
df6.drop(2, level = 'Num')

                  A         B
Group Num
M1    1   -0.497104 -0.754070
      3   -0.116773  1.901755
M2    1    0.238127  1.996652
      3   -1.136645  0.000366

In [224]:
# Aggregation, Groupby

In [225]:
import pandas as pd
import numpy as np
import seaborn as sns

In [226]:
?sns.load_dataset

In [227]:
df = sns.load_dataset('planets')

In [228]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [229]:
df.shape

(1035, 6)

In [230]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [231]:
df['mass'].mean()

2.6381605847953216

In [232]:
df['mass'].count()

513

In [233]:
df['mass'].min()

0.0036

In [234]:
df['mass'].max()

25.0

In [235]:
df['mass'].median()

1.26

In [236]:
df['mass'].sum()

1353.37638

In [237]:
df['mass'].std()

3.8186166509616046

In [238]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [239]:
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [240]:
df.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [241]:
df.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 498 entries, 0 to 784
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          498 non-null    object
 1   number          498 non-null    int64
 2   orbital_period  498 non-null    float64
 3   mass            498 non-null    float64
 4   distance        498 non-null    float64
 5   year            498 non-null    int64
dtypes: float64(3), int64(2), object(1)
memory usage: 27.2+ KB

In [242]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [243]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [244]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [245]:
df['method']

0       Radial Velocity
1       Radial Velocity
2       Radial Velocity
3       Radial Velocity
4       Radial Velocity
             ...
1030            Transit
1031            Transit
1032            Transit
1033            Transit
1034            Transit
Name: method, Length: 1035, dtype: object

In [246]:
df['method'].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [247]:
df['method'].value_counts(dropna = False)

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [248]:
df['mass'].value_counts(dropna = False)

NaN       522
1.800       6
1.900       6
2.600       5
2.300       5
         ...
0.624       1
6.210       1
1.894       1
1.981       1
10.500      1
Name: mass, Length: 382, dtype: int64

In [249]:
df['mass'].nunique()

381

In [250]:
df['method'].nunique()

10

In [251]:
df.groupby('method')

In [252]:
df.groupby('method').mean()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,1.000000,631.180000,NaN,17.875000,2011.500000
Eclipse Timing Variations,1.666667,4751.644444,5.125000,315.360000,2010.000000
Imaging,1.315789,118247.737500,NaN,67.715937,2009.131579
Microlensing,1.173913,3153.571429,NaN,4144.000000,2009.782609
Orbital Brightness Modulation,1.666667,0.709307,NaN,1180.000000,2011.666667
Pulsar Timing,2.200000,7343.021201,NaN,1200.000000,1998.400000
Pulsation Timing Variations,1.000000,1170.000000,NaN,NaN,2007.000000
Radial Velocity,1.721519,823.354680,2.630699,51.600208,2007.518987
Transit,1.954660,21.102073,1.470000,599.298080,2011.236776
Transit Timing Variations,2.250000,79.783500,NaN,1104.333333,2012.500000

In [253]:
df.groupby('method').mean()[['orbital_period']]

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [254]:
df.groupby('method').mean()[['orbital_period']].describe().T

,count,mean,std,min,25%,50%,75%,max
orbital_period,10.0,13622.210413,36841.667788,0.709307,217.632625,996.67734,4352.12619,118247.7375

In [255]:
df.groupby('method')[['orbital_period']].describe()

                              orbital_period                                \
                                       count           mean            std
method
Astrometry                               2.0     631.180000     544.217663
Eclipse Timing Variations                9.0    4751.644444    2499.130945
Imaging                                 12.0  118247.737500  213978.177277
Microlensing                             7.0    3153.571429    1113.166333
Orbital Brightness Modulation            3.0       0.709307       0.725493
Pulsar Timing                            5.0    7343.021201   16313.265573
Pulsation Timing Variations              1.0    1170.000000            NaN
Radial Velocity                        553.0     823.354680    1454.926210
Transit                                397.0      21.102073      46.185893
Transit Timing Variations                3.0      79.783500      71.599884

                                                                       \
                                       min          25%           50%
method
Astrometry                      246.360000   438.770000    631.180000
Eclipse Timing Variations      1916.250000  2900.000000   4343.500000
Imaging                        4639.150000  8343.900000  27500.000000
Microlensing                   1825.000000  2375.000000   3300.000000
Orbital Brightness Modulation     0.240104     0.291496      0.342887
Pulsar Timing                     0.090706    25.262000     66.541900
Pulsation Timing Variations    1170.000000  1170.000000   1170.000000
Radial Velocity                   0.736540    38.021000    360.200000
Transit                           0.355000     3.160630      5.714932
Transit Timing Variations        22.339500    39.675250     57.011000


                                        75%            max
method
Astrometry                       823.590000    1016.000000
Eclipse Timing Variations       5767.000000   10220.000000
Imaging                        94250.000000  730000.000000
Microlensing                    3550.000000    5100.000000
Orbital Brightness Modulation      0.943908       1.544929
Pulsar Timing                     98.211400   36525.000000
Pulsation Timing Variations     1170.000000    1170.000000
Radial Velocity                  982.000000   17337.500000
Transit                           16.145700     331.600590
Transit Timing Variations        108.505500     160.000000

In [256]:
df.groupby('method')['distance'].sum()

method
Astrometry                           35.75
Eclipse Timing Variations          1261.44
Imaging                            2166.91
Microlensing                      41440.00
Orbital Brightness Modulation      2360.00
Pulsar Timing                      1200.00
Pulsation Timing Variations           0.00
Radial Velocity                   27348.11
Transit                          134242.77
Transit Timing Variations          3313.00
Name: distance, dtype: float64

In [257]:
df['year']

0       2006
1       2008
2       2011
3       2007
4       2009
        ...
1030    2006
1031    2007
1032    2007
1033    2008
1034    2008
Name: year, Length: 1035, dtype: int64

In [258]:
df['year'].value_counts(dropna = False)

2011    185
2012    140
2013    118
2010    102
2009     98
2008     74
2007     53
2014     52
2005     39
2002     32
2006     31
2004     26
2003     25
2000     16
1999     15
2001     12
1996      6
1998      5
1992      2
1997      1
1995      1
1994      1
1989      1
Name: year, dtype: int64

In [259]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994])

In [260]:
df.groupby('year').mean()['mass']     # = df.groupby('year')['mass'].mean()

year
1989    11.680000
1992          NaN
1994          NaN
1995     0.472000
1996     1.979400
1997     1.040000
1998     2.687120
1999     3.236643
2000     3.633014
2001     3.430909
2002     3.937290
2003     3.660955
2004     1.454267
2005     2.003897
2006     1.799800
2007     3.702094
2008     3.424339
2009     3.628568
2010     1.289610
2011     1.209084
2012     3.658596
2013     2.203400
2014     1.068000
Name: mass, dtype: float64

In [261]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales' : [200, 120, 340, 124, 243, 350]}

In [262]:
df7 = pd.DataFrame(data)

In [263]:
df7

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [264]:
df7.groupby('Company')

In [265]:
by_comp = df7.groupby('Company')

In [266]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [267]:
df7

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [268]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [269]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [270]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [271]:
by_comp.describe().T['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [272]:
df8 = pd.DataFrame({'col1' : [1, 2, 3, 4],
                  'col2' : [444, 555, 666, 444],
                  'col3' : ['abc', 'def', 'ghi', 'xyz']})

In [273]:
df8

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [274]:
df8['col2'].unique()

array([444, 555, 666])

In [275]:
df8['col2'].value_counts(dropna = False)

444    2
555    1
666    1
Name: col2, dtype: int64

In [276]:
df8[(df8['col1'] > 2) & (df8['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [277]:
df8

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [278]:
del df8['col2']

In [279]:
df8

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [280]:
df8.columns

Index(['col1', 'col3'], dtype='object')

In [281]:
df8.index

RangeIndex(start=0, stop=4, step=1)

In [282]:
df8

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [283]:
df8.sort_values(by = 'col3', ascending = False)

   col1 col3
3     4  xyz
2     3  ghi
1     2  def
0     1  abc

In [284]:
df8

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [87]:
df9 = pd.DataFrame({'col1' : [1, 2, 3, np.nan],
                  'col2' : [np.nan, 555, 666, 444],
                  'col3' : ['abc', 'def', 'ghi', 'xyz']})

In [286]:
df9

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [287]:
df9.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [288]:
df9

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [289]:
df9.fillna('milk')

   col1  col2 col3
0     1  milk  abc
1     2   555  def
2     3   666  ghi
3  milk   444  xyz

In [290]:
df9.dropna(how = 'all')

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [291]:
df9.dropna(how = 'any')

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [3]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [10]:
df4.groupby('groups').mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [14]:
df4.groupby('groups').aggregate('mean')

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [5]:
df4.groupby('groups').aggregate([np.min, np.median, np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10     16   22  100    181  262
B        11     17   23  111    182  253
C        33     66   99  333    651  969

In [18]:
df4.groupby('groups').aggregate({'var1' : 'min', 'var2' : 'max'})

        var1  var2
groups
A         10   262
B         11   253
C         33   969

In [17]:
df4.groupby('groups').aggregate({'var1' : 'min', 'var2' : [np.median, np.max]})

       var1   var2
        min median amax
groups
A        10    181  262
B        11    182  253
C        33    651  969

In [2]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [316]:
df4.groupby('groups').std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  449.719913

In [67]:
# filter, transform, apply

In [303]:
def filter_function(x):
    return x['var1'].std() > 9

In [68]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [304]:
df4.groupby('groups').filter(filter_function)

  groups  var1  var2
2      C    33   333
5      C    99   969

In [313]:
df4.groupby('groups').sum()

        var1  var2
groups
A         32   362
B         34   364
C        132  1302

In [310]:
df4.groupby('groups').filter(lambda x : x['var2'].sum() < 444)

  groups  var1  var2
0      A    10   100
1      B    23   253
3      A    22   262
4      B    11   111

In [317]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [320]:
df4['var1'] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [75]:
df_a = df4.iloc[:, 1:3]

In [76]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [79]:
df_a.transform(lambda x : (x-x.mean()) / x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [81]:
df_a.transform(lambda x : np.log10(x))

       var1      var2
0  1.000000  2.000000
1  1.361728  2.403121
2  1.518514  2.522444
3  1.342423  2.418301
4  1.041393  2.045323
5  1.995635  2.986324

In [9]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [10]:
df4.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [83]:
df4[['var1', 'var2']].apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [16]:
df_numeric = df4.iloc[:, 1 : 3]

In [17]:
df_numeric.apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [19]:
df_numeric.apply(np.mean, axis = 1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [20]:
df_numeric.apply(np.mean, axis = 0)

var1     33.0
var2    338.0
dtype: float64

In [84]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [86]:
df4.groupby('groups').apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [23]:
df4.groupby('groups').mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [38]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abcc','de','ghi','xyyzz']})
df2

   col1  col2   col3
0     1   444   abcc
1     2   555     de
2     3   666    ghi
3     4   444  xyyzz

In [34]:
def times2(x):
    return x * 2

In [35]:
df2['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [39]:
df2['col3'].apply(len)

0    4
1    2
2    3
3    5
Name: col3, dtype: int64

In [41]:
df2.apply(len)

col1    4
col2    4
col3    4
dtype: int64

In [40]:
df2['col3'].apply(str.upper)

0     ABCC
1       DE
2      GHI
3    XYYZZ
Name: col3, dtype: object

In [48]:
df2['col3'].transform(len)

0    4
1    2
2    3
3    5
Name: col3, dtype: int64

In [49]:
df2['col3'].transform(str.upper)

0     ABCC
1       DE
2      GHI
3    XYYZZ
Name: col3, dtype: object

In [50]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [54]:
df3.apply(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [52]:
df3.transform(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [56]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [55]:
df3.groupby('grp').apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [57]:
df3.groupby('grp').transform(sum)

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

In [62]:
df3.groupby(['P', 'Q']).sum()

          grp
P Q
9 25  aaaabbb

In [63]:
df3.groupby('grp').transform(len)

   P  Q
0  4  4
1  4  4
2  4  4
3  4  4
4  3  3
5  3  3
6  3  3

In [38]:
import seaborn as sns

In [39]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [40]:
titanic = sns.load_dataset('titanic')

In [41]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [42]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [43]:
titanic.groupby(['sex', 'class'])[['survived']].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [86]:
titanic.groupby(['sex', 'class'])[['survived']].aggregate('mean').unstack()

        survived
class     First     Second    Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [89]:
titanic.pivot_table('survived', 'sex', 'class')       # values, index, columns, aggfunc(default is 'mean')

class     First     Second    Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [44]:
titanic.pivot_table('survived', 'sex', 'class', 'sum')    # values, index, columns, aggfunc

class   First   Second  Third
sex
female      91      70      72
male        45      17      47

In [53]:
titanic.pivot_table(values = 'who', index = 'sex', columns = 'class', aggfunc = 'count')

class   First   Second  Third
sex
female      94      76     144
male       122     108     347

In [55]:
titanic.groupby('sex')[['sex']].count()

        sex
sex
female  314
male    577

In [57]:
titanic.groupby('sex')[['survived']].sum()

        survived
sex
female       233
male         109

In [66]:
titanic.groupby('adult_male')[['survived']].sum()

            survived
adult_male
False            254
True              88

In [92]:
titanic.pivot_table('age', 'sex', 'class', 'mean')    # values, index, columns, aggfunc

class      First      Second     Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [93]:
titanic.pivot_table('age', 'sex', 'class')  # default aggregate function is mean

class      First      Second     Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [94]:
titanic.pivot_table('age', 'class', 'sex')  # values, index, columns, aggfunc

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [95]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}
df5 = pd.DataFrame(data)
df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [97]:
df5.pivot_table('D', 'C', ['A', 'B'])

A  bar       foo
B  one  two  one  two
C
x  4.0  NaN  1.0  2.0
y  1.0  5.0  3.0  NaN

In [98]:
df5.pivot_table('D', ['A', 'B'], 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [20]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']}
                        )

In [21]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']}
                         )

In [22]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']}
                        )

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [25]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [104]:
pd.concat([df1, df2, df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [105]:
pd.concat([df1, df2, df3], ignore_index = True)   # we can give new index(with order) by ignore_index arg.

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [107]:
pd.concat([df1, df2, df3], axis = 1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [27]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0,1,2,3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                        index=[4,5,6,7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])

In [37]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [111]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [113]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [114]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [117]:
pd.merge(left, right, how = 'right', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [123]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'A': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [124]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [125]:
right

  key   A   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [126]:
pd.merge(left, right, how = 'inner', on = 'key')

  key A_x   B A_y   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [127]:
pd.merge(left, right, how = 'outer', on = 'key')

  key  A_x    B A_y   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [128]:
pd.merge(left, right, how = 'left', on = 'key')

  key A_x   B A_y   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [129]:
pd.merge(left, right, how = 'right', on = 'key')

  key  A_x    B A_y   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [130]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K4', 'K5'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [131]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K4  A2  B2
3  K5  A3  B3

In [132]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [133]:
pd.merge(left, right, on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1

In [134]:
pd.merge(left, right, how = 'outer', on = 'key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K4   A2   B2  NaN  NaN
3  K5   A3   B3  NaN  NaN
4  K2  NaN  NaN   C2   D2
5  K3  NaN  NaN   C3   D3

In [135]:
pd.merge(left, right, how = 'left', on = 'key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K4  A2  B2  NaN  NaN
3  K5  A3  B3  NaN  NaN

In [136]:
pd.merge(left, right, how = 'right', on = 'key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2  NaN  NaN  C2  D2
3  K3  NaN  NaN  C3  D3

In [137]:
left1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right1 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [138]:
left1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [139]:
right1

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [141]:
pd.merge(left1, right1, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [142]:
pd.merge(left1, right1, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3